# Python 数字数据类型用于存储数值。
# 数据类型是不允许改变的,这就意味着如果改变数字数据类型的值，将重新分配内存空间。

# 一、创建 Number

number = 1

print(number) # 1

number = 2

print(number) # 2

# 二、Number 支持的数据类型

# 1. 整型(int)
    # 通常被称为是整型或整数，是正或负整数，不带小数点。
    
    # 1 2 10 20 1000 


# 2.浮点型(float)
    #  浮点型由整数部分与小数部分组成，

    # 3.1 3.014 3.1415926

# 3.复数( (complex))
    # 复数由实数部分和虚数部分构成，可以用a + bj,或者complex(a,b)表示， 复数的实部a和虚部b都是浮点型。

    # x + y + 1

# 三、数据类型的转换

# 1. int(x)  转换为整数

# 2. float(x) 转换为浮点数

# 3. complex(x) 将x转换到一个复数，实数部分为 x，虚数部分为 0。

# 4. complex(x, y) 将 x 和 y 转换到一个复数，实数部分为 x，虚数部分为 y。x 和 y 是数字表达式。

